[
  {
    "id": 1,
    "user": 1,
    "title": "Secret作為模組化區塊鏈",
    "picture": "https://miro.medium.com/v2/resize:fit:786/format:webp/0*qre_fPP-_hEl_YU-",
    "content": "區塊鏈架構模型隨著過去十年區塊鏈技術的發展，我們正在見證區塊鏈架構以及看待它和分類它的方式的演變。在這篇文章中，我們將描述最受歡迎的區塊鏈架構模型——整體式、分層式和模組化，並了解Secret的新願景如何適應新穎的模組化範式。讓我們深入了解一下。整體模型從比特幣開始，最初的區塊鏈是使用整體架構創建的，其中一個軟體負責所有功能。比特幣、以太坊、Solana以及它們各自的克隆和變體——所有這些區塊鏈至少在最初遵循相同的整體設計。整體設計有其優點——區塊鏈節點的所有部分都在同一個可執行檔中運行，這意味著測試和部署相對容易、不同模組之間的低延遲通訊、資源效率等等。然而，整體設計是僵化的，可能會阻止根本性的改變——畢竟，一切都是緊密耦合的。層次模型隨著技術的發展和區塊鏈使用的成長，這種架構的限制變得明顯，人們開始考慮「第二層」或「L2」解決方案，第一個L2網路是更快的支付基礎設施，例如比特幣的閃電網路和以太坊的Plasma，隨後是透過大量的解決方案，如Polygon、Optimism、Arbitrum等等。最初，該架構假設只有兩層，但整齊的分層結構確實有其魅力，人們開始將Dapp稱為“Layer3”，將用戶界面稱為“Layer4”，將跨鏈橋接服務稱為“LayerZero”"
  },
  {
    "id": 2,
    "user": 2,
    "title": "區塊鏈是一個OpenDMP_一種零方數據的可能性",
    "picture": "https://miro.medium.com/v2/resize:fit:828/format:webp/1*I2EUJBe1t-dqkbmewwWiSg.png",
    "content": "雖然今年AI很熱，不過Blockchain默默漲回了一些關注，在產業應用裡面，這兩個技術最終會匯流，都為產業所用，摻在一起做成撒尿牛丸。其實去掉Crypto的各種炒作，Blockchain作為技術本身應該是中立的，而且他讓用戶自我管理數據、自我證明的特性，有機會帶來一些新應用的機會。像是一直以來都很熱門的「數據」，從CRM,CDP,到DMP，從第一方、第二方、第三方數據，區塊鏈的技術，有機會成為實作消費者「零方數據」的可能性，並對品牌來說變成為一個OpenDMP。聽起來很弔詭？區塊鏈技術本身就帶有一種悖論：他是高度匿名注重隱私，卻又高度數據開放。區塊鏈如果進到產業應用，又帶來另外一種悖論：去中心化的Web3，與中心化Web2.0平台結合，這樣還是去中心化嗎？現在的世界，越來越多的事情，已經很難二元性單純區分了。非黑即白，非藍即綠。這一篇的討論，拋出了很多的可能性，相信也帶了很多問題，許多也都沒有答案，也許在2024，可以有機會一點一點回答，給出真正的解決方案。如果你剛好是一個區塊鏈的團隊，看完之後非常有想法，想跟我們合作，請趕快私訊我，也許帶來新解答的就是你。消費者擁有自己的消費數據在上一篇「區塊鏈的零售業應用(1)—WEB2.0X區塊鏈：連結所創造的新機會」，我們討論到了消費者可以透過區塊鏈技術，擁有自己的消費記錄，但，擁有自己的消費紀錄，消費者可以做什麼？我們會加入品牌會員，累積消費記錄，通常是因為品牌的的忠誠度計畫，也就是品牌會對消費貢獻越大的會員越好。譬如透過累積消費記錄升等，越高等級可以獲得的回饋越多。品牌跟消費者的關係，幾乎都是根據在消費記錄之上。"
  },
  {
    "id": 3,
    "user": 3,
    "title": "為什麼CBDC不會在去中心化的區塊鏈上發行?",
    "picture": "https://miro.medium.com/v2/resize:fit:828/format:webp/1*iGSWedqLIxQur9q7qKPZmg.jpeg",
    "content": "何謂CBDC，一種由央行發行的數位現金CBDC，Central Bank Digital Currency，中央銀行數字貨幣，其實可以理解為一種數位版的現金。這和我們在網銀裡面看到的現金不同，網銀裡的現金代表的是商業銀行的負債(對應用戶的資產)，CBDC代表的是央行的負債(對應用戶的資產)，也就是說除非央行倒閉，否則CBDC的安全性(信用)將遠大於普通的商業銀行。美元穩定幣不是美元CBDC作為法幣，就得由中央機構統許可才能發行。但今天的美元穩定幣其實不是美元(USdollar)，只是一個人們相信可以與美元1:1兌換的貨幣。主流的美元穩定幣包含兩種:USDT與USDC，USDT是由泰達公司所發行的穩定幣，背後的價值基礎來自等值的美元及債券儲備，USDC則是由Circle公司所發行，背後的價值支撐也是來自於美元儲備。理論上用戶每存入1元美元，可以鑄造出1元美元穩定幣。而實際上，美元穩定幣的匯率並不總是穩定，今年二月當Circle被銀行封殺時，USDC與美元的兌換比率一下子就來到了0.9。穩定幣組成，目前整體市值約1200億美金(source:glassnode)法幣本質上沒辦法被去中心化去中心化程度高的帳本才是相對安全或是可信的帳本。否則就像投票一樣，看起來人人均可參與，但投了半天最後發現計票的人黑箱作業，那麼所有的主權在民都是笑話一場。而區塊鏈帶來的信任價值，其基礎就是去中心化的制度設計。人人都可以參與驗證，自然信用不是基於想像，這也就是幣圈人常說的don’ttrust,verify。更多關於區塊鏈的信任價值可見先前的文章。"
  },
  {
    "id": 4,
    "user": 4,
    "title": "區塊鏈時代的證券新形態",
    "picture": "https://miro.medium.com/v2/resize:fit:828/format:webp/1*vd2RXoKc0IzFplIzWdxg7w.png",
    "content": "證券型代幣發行（SecurityTokenOffering；簡稱STO）指在符合證券市場的監管要求下，利用日新月異的區塊鏈技術，將股票、房地產、古董等有形和無形資產代幣化的一種企業融資途徑。證券型代幣的底層技術是區塊鏈，以此進行的每項交易都屬匿名，並公開記賬，所用代幣標誌對有關資產或證券的擁有權。所有STO交易都會儲存於數碼交易分類賬中，以免資料遭任意篡改，既高度透明，也高度安全。為證券定義1946年美國證券交易委員會起訴Howey公司，最高法院裁定，一項投資是否屬於「證券」，必須具備4項條件：一、金錢形式進行的資產投資；二、預期從中獲得收益；三、資金投放於共同業務（commonenterprise）；四、收益通過發行人或第三方收取。這就是著名的豪威測試（HoweyTest），其對今日推展虛擬資產市場發揮舉足輕重的作用。證券型代幣作為投資產品，通常符合上述標準，而發行人的收益、現金流或資產份額的證券型代幣，無論採用何種合約形式，實質上都屬於證券範疇，受證券法約束。投資快車道現時投資者通常只能透過購買公司的股份或證券來投資。有了STO，投資者的組合可以更多元化，即使擁有權不易轉移的資產，如私人債務及股份、名畫等，可經代幣化分割成可買賣的數目，以代幣的形式進行交易。以一幅價值400萬美元的名畫為例，代幣化後將擁有權分為4000份，每份價值變為1000美元，就可讓一般投資者也能入場。"
  },
  {
    "id": 5,
    "user": 5,
    "title": "飛鳥遊報#31-區塊鏈遊戲公會YGG訪談/聊聊遊戲審美這件事/閒聊LTV的不可預測性(2021/10/20)",
    "picture": "https://miro.medium.com/v2/resize:fit:750/format:webp/0*Mh_E4njN_R6ycoc3",
    "content": "近期身邊所有做遊戲研發的朋友，幾乎都開始跟各種區塊鏈或NFT遊戲開發沾上邊，當一個新風潮達到全民皆兵的狀況時，通常也離泡沫破滅秩序重整不遠，這個過程能把市場中的劣幣驅逐，留下那些真正具有開創精神的業者，繼續打造產業的新規則。本期的週報，有非常多區塊鏈遊戲的消息，有禁止的，有擁抱的，有創立新商業模式的，也有捲款潛逃的。歡迎來到朝氣蓬勃(群魔亂舞)的區塊鏈遊戲時代。本週精選粉絲團文章區塊鏈遊戲公會YieldGuildGames訪談YieldGuildGames是由一群相信“play-to-earn”(邊玩邊賺)理念成員所組成的遊戲公會，也是一個去中心化自治組織（DAO），所有者爲全體投資人和玩家。他們會尋找具有長期發展潛力的區塊鏈遊戲，由社群經理去教育玩家，而公會出借資產，玩家在遊戲中所獲得的收益，最終將20%給經理，10%給公會，70%歸自己所有，而公會則會拿這些錢再去進行投資其他區塊鏈遊戲。Axie是YieldGuildGames目前最主要的投資項目，玩家平均每個月的收入400~600美元，最多可到1000美元，投資回報期約2~3個月。到目前為止，總共投資了約13款區塊鏈遊戲。我覺得在Naavik網站的這個訪談中，可以看到更為“實際”的區塊鏈人士觀點。因為YieldGuildGames所著重的是“長期利益”，它就像是租賃公司，提早買下一個有價值的遊戲資產(NFT)，然後花數年租給需要他的玩家。以Axie這款遊戲來說，因為購買寵物的門檻很高需要上萬元，YGG就將寵物出租給手頭不這麼寬裕的用戶，讓其幫忙打工賺取利益。這套商業模式有幾個先決條件，第一，遊戲要有明確的賺錢模式；第二，遊戲要能夠活得長久。而訪談中YGG聯合創始人GabbyDizon也承認，目前符合這個標準的區塊鏈遊戲，也就只有AxieInfinity。而Axie目前的收入與商業模式，還是仰賴於大量的新玩家進入，當熱潮過了新玩家退去現有經濟體系是否能支撐還是未定數。當然，他們對未來還是相對樂觀，也認為Axie距離人數峰值還有很大的潛力空間。不過另一個有趣的觀點是，Gabby認為有些區塊鏈遊戲在前期炒作代幣價格的行為，會被他們視為「危險的訊號」。因為這會使得玩家(炒手)一窩蜂的進來，又因為韭菜被割完後一窩蜂地離開，尋找下一個遊戲，這對於想要長期營運的遊戲來說，並不是一件好事。這也是目前區塊鏈遊戲的主要問題，行業變化得太快，遊戲規則不停重寫，新手理解的門檻越墊越高，所有今天看起來新的模式玩法，過幾天似乎又變舊了。"
  },
  {
    "id": 6,
    "user": 1,
    "title": "文組轉職澳洲科技大廠工程師—我的職涯反思",
    "picture": "https://miro.medium.com/v2/resize:fit:828/format:webp/0*VPTnrBLCs211J6nV",
    "content": "雖然我2020.09才踏進科技業，才短短3.5年就要談職涯反思，好像不夠有說服力🤣不過就請大家把重點放在「我的」(加粗)科技業職涯反思吧😆如果你是第一次看我的文章，你好，我是EC!我在2020年透過就讀六個月的codingbootcamp成功從文組轉職科技業，第一份工作在AWS(AmazonWebServices)當ProfessionalServicesTechnicalConsultant，第二份工作在微軟當CloudSolutionArchitect，第三份工作(也就是現職)在Shell(世界第二大石油公司，市值超過微軟)當DevOpsPlatformEngineer。非Medium付費會員，請點此免費閱讀這篇文章！當然如果你願意加入Medium付費會員來支持創作者，那就更棒囉～感謝你的閱讀！"
  },
  {
    "id": 7,
    "user": 2,
    "title": "Netflix邪教犯罪法劇《謎殺山》戰鬥力無窮，好看嗎？教主和科技公司有什麼瓜葛？結局有彩蛋",
    "picture": "https://miro.medium.com/v2/resize:fit:828/format:webp/0*Jl_XL0mUk4ucyj1R",
    "content": "《謎殺人》故事內容身患絕症穿搭爆炸的女主(與女演員NoémieSchmidt私底下的外表超有反差)在當記者的父親失蹤後到雪山Lévionna1尋人，搭上了誤入歧途的年輕男生，兩人連同當地女警和本地男孩組隊，依靠網絡力量和非凡的戰鬥mode一層一層揭開30年前邪教組織集體死掉12人故事背後的真相。身為迷你影集的法劇《謎殺山》簡單只有六集，季尾似乎還留有第二季的可能性。《謎殺山》的另一個譯名《第13個教徒》透露了一點點情節，秘密的第十三人到底發生什麼事？"
  },
  {
    "id": 8,
    "user": 3,
    "title": "科技如何拯救脆弱的藝術？",
    "picture": "https://miro.medium.com/v2/resize:fit:828/format:webp/0*__658dwox4yf8W3f.png",
    "content": "藝術與技術在歷史上一直有著共生關係。從有助於創作寫實繪畫的暗箱的發明，到實現新的藝術表現形式的數位革命，科技不斷影響和塑造藝術世界。相反，藝術家往往處於技術創新的前沿，突破創造力的界限並挑戰傳統規範​​。藝術品保存技術的演變藝術品的保存一直是收藏家、博物館和藝術愛好者一直關注的問題。多年來，科技已發展成為這項努力的關鍵工具。從保護技術的進步到修復專用設備的開發，技術在維護藝術品的完整性方面發揮了關鍵作用。然而，傳統的保存方法有其局限性，特別是對於易碎或短暫的藝術品而言。這就是區塊鏈技術和NFT發揮作用的地方，提供新穎的解決方案來應對數位時代保護藝術品的挑戰。"
  },
  {
    "id": 9,
    "user": 4,
    "title": "對幣價有害的新科技",
    "picture": "https://miro.medium.com/v2/resize:fit:828/format:webp/1*HhmiKaMkRUwwvWUZo3ayKA.png",
    "content": "技術帶動價格（嗎？每當有新技術消息出來，市場往往認為新技術會帶動需求，從而推升一些幣的價格、拉低另一些幣的價格。例如有些人稱今年會是「質押年」，EigenLayer登場之後，Restaking應用如雨後春筍，市場認為以太坊質押量會增加，因此以太幣買氣增加，價格必須漲。不過，關於技術對幣價的影響，還有一種從供給需求曲線變化、基礎經濟學的觀點，比方說這篇EIP1559文章。因為協議改動也與貨幣發行量息息相關，我們需要以更長線的方式理解區塊鏈領域的新科技如何形塑價格均衡。"
  },
  {
    "id": 10,
    "user": 5,
    "title": "高科技接觸點正在改變顧客體驗",
    "picture": "https://miro.medium.com/v2/resize:fit:828/format:webp/1*9oy2jNyW_t31hacYKb8dzQ.jpeg",
    "content": "文章精華：科技驅動的全通路（Omnichannel）體驗科技應用的例子抓住科技商機的建議方向在科技發達的時代，人們對全通路（Omnichannel）的概念更加重視，企業與顧客之間的互動變得更加頻繁且複雜。波士頓諮詢集團的董事總經理兼客戶體驗全球領導人卡倫·勒盧什·陶德曼（KarenLelloucheTordjman）在2023年3月《哈佛商業評論》的文章〈高科技接觸點正在改變顧客體驗〉（High-TechTouchpointsAreChangingCustomerExperience）中指出，企業需要重新審視與顧客的接觸點，並思考如何提升顧客體驗。"
  }
]